[
    {
        "description": "He was killed so that Elizabeth could have Annabelle to themself.",
        "motive_id": "lez1",
        "interaction_id": "E3"
    },
    {
        "description": "He was killed so that Annabelle could continue her relationship with Annabelle",
        "motive_id": "lez2",
        "interaction_id": "A10"
    },
    {
        "description": "He was killed so that Matthew could take the sword for himself.",
        "motive_id": "swo1",
        "interaction_id": "M8"
    },
    {
        "description": "He was killed so that Sir Edmond could take the sword.",
        "motive_id": "trhu",
        "interaction_id": "S2"
    },
    {
        "description": "He was killed by Jeramiah because he was angry that Jameson bought the house",
        "motive_id": "hous",
        "interaction_id": "A2"
    },
    {
        "description": "He was killed because Elizabeth, still angry about being passed over as heir, wanted contol of the family fortune.",
        "motive_id": "inhe",
        "interaction_id": "E8"
    },
    {
        "description": "He was killed by Marguerite in her drunken stupor because she's an absolute menace.",
        "motive_id": "drun",
        "interaction_id": "B7"
    },
    {
        "description": "He was killed by accident when Matthew was trying to kill Sir Edmond.",
        "motive_id": "acci",
        "interaction_id": "M8"
    },
    {
        "description": "He was killed after Olga had a bout of insanity over a lightly burnt Crumpet",
        "motive_id": "insa",
        "interaction_id": "Tr1"
    },
    {
        "description": "He was killed by Matthew because he was jalous of his looks.",
        "motive_id": "jeal",
        "interaction_id": "A6"
    },
    {
        "description": "He was killed by Annabelle because she always resented him for taking part in this arranged marriage.",
        "motive_id": "arra",
        "interaction_id": "Le1"
    },
    {
        "description": "He was killed by Jeramiah because he looked similiar to the original owner of the house, and wanted to kepp Annabelle for himself.",
        "motive_id": "wife",
        "interaction_id": "Gs1"
    },
    {
        "description": "Sir Edmund killed Jerome for the thrill of the hunt.",
        "motive_id": "hunt",
        "interaction_id": "E7"
    },
    {
        "description": "Olga killed Jameson in a fit of rage for allowing Marguerite into the house, and expecting her to cluen up her path of destruction.",
        "motive_id": "puke",
        "interaction_id": "O7"
    },
    {
        "description": "Jeramiah killed him because Jerome had uncovered evidence related to him murdering the previous owner of the house.",
        "motive_id": "coup",
        "interaction_id": "B6"
    },
    {
        "description": "Matthew killed Jerome because he didn't defend his honor after Annabelle called him a little rat boy.",
        "motive_id": "rboy",
        "interaction_id": "A6"
    }
]