[
    {
        "description": "Upon closer examination Annabelle is a beautiful woman. She is dressed for a party, wearing a bright yellow gown, white elbow length gloves and a pair of white slippers. Her hands have never known a day of labor. She carries on her face a practiced neutral expression. If it weren't for her hidden glances towards Elizabeth it would seem she is completely unaware of tonights events.",
        "interaction_id": "A1"
    },
    {
        "description": "Jeremiah, who else? The man has been living here alone for decades, he's obviously crazy. He wasn't happy about the sale of the house.",
        "interaction_id": "A2"
    },
    {
        "description": "He's a long time friend of Jameson, but I hardly know him. He's been galavanting around the world for as long as I've known Jameson",
        "interaction_id": "A3"
    },
    {
        "description": "He murdered my fiance. I just know it",
        "interaction_id": "A4"
    },
    {
        "description": "She's been a ray of sunshine in my life. Sure she has something of sibling rivalry with Jameson, but what brother and sister don't? She's smart and witty and I was so looking forward to being a part of her family.",
        "interaction_id": "A5"
    },
    {
        "description": "Oh that weasel? A scummy layabout who's done nothing for my fiance's business, but still demands 50% ownership. I don't know what Jameson saw in him.",
        "interaction_id": "A6"
    },
    {
        "description": "She's fun when she's coherent at least. Good luck making any sense of her after the first bottle, the poor dear. She could use a cup of coffee, I'd wager.",
        "interaction_id": "A7"
    },
    {
        "description": "I was powdering my nose",
        "interaction_id": "A8"
    },
    {
        "description": "Is it a crime for two women to have a conversation? I just happend to run into her on the way to the bathroom.",
        "interaction_id": "A9"
    },
    {
        "description": "Is it really that obvious? We've been having an affair for months now. Alas, my marriage to Jameson would have made things incredibly complicated. Not that I would murder him over that!",
        "interaction_id": "A10"
    },
    {
        "description": "",
        "interaction_id": ""
    },
    {
        "description": "",
        "interaction_id": ""
    }
]