[
    {
        "success": false,
        "message": "Dear User, I suspected that you were the killer the whole time. I was keen to arresting you the second you were found with the body, and after throwing around such a baseless accusation against ______ there was no doubt in my mind that you slayed Mr. Holloway. We may not know how or why you killed him, but my suspicion is that you're simply a mal-adjusted discontent not fit for participation in society. I pray every night for God to relieve you of your deviance so that you might understand your sins as you are dropped off a wooden platform straight into eternal damnation."
    },
    {
        "success": true,
        "message": "The constable twirls his mustache thoughtfully as you make your case.  Knowing full well your innocence rides on the success of your argument, you can only pray the truth in your words has reached him.  Following a paralyzing silence, the constable at last sighs and regards you with a half-smile. \n “I had been so convinced of your guilt that the possibility had not even occurred to me to consider the murder weapon. But you have made it clear beyond a doubt that Mr. Wilde is responsible for this heinous act. I apologize for the indignity I foisted upon you.” He pivots on his heels and turns to lead you into the dining hall where Matthew Wilde is waiting.\n“Come, we have a criminal to apprehend.”\nYou arrive to see the newly accused sipping an old-fashioned, his naturally gaunt face comically distorted in the glass as he brings it to his lips. Marguerite is folded over the table, still nursing the coffee you brought her.\n“Can I help you, constable?” The calm in his voice belies his almost certainly guilty conscience. With all of the questions you previously leveled at him, it would be nigh impossible for him not to have foreseen this.\n“Mr. Matthew Wilde,” the constable begins, his voice thick with practiced authority, “you are under arrest for the murder of Mr. Jameson Halloway.” The room is silent for the briefest of moments, before Marguerite lets out a belated squeal of surprise.\n“What? But why?” she exclaims. “Surely he would have no reason to kill Mr. Halloway.”\n“Indeed,” the constable nods. “The motive does not entirely fit, but there is little room for doubt that it was Mr. Wilde’s contraption that dealt the fatal blow to his late business partner. A friendship betrayed with the gravest of sins.”\nMatthew’s stoic countenance splinters, as a single tear escapes his eyes with a sniffle. There is time for the single drop to trace its way along the angular features before he at last speaks.\n“I never meant to kill him.”  The words start as a whisper, but his voice cracks as he continues. “That bolt was meant for Sir Edmond.” \nMarguerite gasps again, jolting upright and nearly spilling her drink.\n“He had his eyes on that sword. That accursed sword that I so very much needed. I simply could not allow him to obtain such a valuable relic only to have it gather dust in his already overcrowded trophy room. I needed… the company needed the money direly.” His eyes begin to well over with tears. “But that fool Jameson had to be the one to trigger the trap…”\nHe collapses atop the linen in a mess of tears, dropping his drink to the floor.\n“I ask Edmond to retrieve that book from the study!  Why did Jameson have to be such a gentleman and offer to go in his stead?”\nThe constable moves to place a hand atop Matthew’s shoulder, but he swats it away.\n“This is your fault,” he bawls, aiming a finger at you like the crosshairs of a rifle, “if you had just stayed quiet and taken the blame like you were supposed to, none of this would have happened!”\n“Alright, that’s enough,” the constable scolds, grabbing the murderer by his arm. “It’s time to go.” With a click, a pair of cuffs are fastened to his wrists and he is led away, shouting all the while.\nYou offer a polite bow to Marguerite, already on her next drink, before taking your own leave.\nWith the true culprit apprehended you are at last free to leave. Crossing the threshold, you step out into the crisp evening air and take a deep breath.\nCongratulations!  You have successfully solved the Murder of Llewelyn Manor!"
    }
]